_posts/lnx/2014-02-20-ubuntu-update-sources.html
---
layout: post
title: "Ubuntu 更新源"
date: 2014-02-20
categories: Linux
tags:
    - Ubuntu
---

<div id="outline-container-orgfebb7da" class="outline-2">
<h2 id="orgfebb7da"><span class="section-number-2">1</span> 1. 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
本文参考了 <a href="http://wiki.ubuntu.org.cn/Qref/Source">Ubuntu 中文 Wiki</a>。
</p>
</div>
</div>

<div id="outline-container-org425f13e" class="outline-2">
<h2 id="org425f13e"><span class="section-number-2">2</span> 2. 更新步骤</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbe33e13" class="outline-3">
<h3 id="orgbe33e13"><span class="section-number-3">2.1</span> 2.1. 首先备份源列表：</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh">sudo cp /etc/apt/sources.list /etc/apt/sources.list_backup
</pre>
</div>
</div>
</div>

<div id="outline-container-orgddc1a19" class="outline-3">
<h3 id="orgddc1a19"><span class="section-number-3">2.2</span> 2.2. 而后用 gedit 或其他编辑器打开：</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh">gksu gedit /etc/apt/sources.lis
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e2c101" class="outline-3">
<h3 id="org7e2c101"><span class="section-number-3">2.3</span> 2.3.</h3>
<div class="outline-text-3" id="text-2-3">
<p>
从下面"Ubuntu13.10 源列表"中选择合适的源，替换掉文件中所有的内容，保存编辑好的文件，注意一定要选对版本：
</p>
</div>
</div>

<div id="outline-container-orgcca151d" class="outline-3">
<h3 id="orgcca151d"><span class="section-number-3">2.4</span> 2.4. 刷新列表，注意：一定要执行刷新：</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-sh">sudo apt-get update
</pre>
</div>
</div>
</div>

<div id="outline-container-org2670393" class="outline-3">
<h3 id="org2670393"><span class="section-number-3">2.5</span> 2.5. 更新系统（可选）：</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-sh">sudo apt-get upgrade
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org13c4d8f" class="outline-2">
<h2 id="org13c4d8f"><span class="section-number-2">3</span> 3. 使用 "apt-fast" 更新提速</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org239e083" class="outline-3">
<h3 id="org239e083"><span class="section-number-3">3.1</span> 3.1. 安装 "apt-fast"：</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh">sudo apt-get install axel aria2
sudo add-apt-repository ppa:apt-fast/stable
sudo apt-get update
sudo apt-get install apt-fast
</pre>
</div>
</div>
</div>

<div id="outline-container-org70e40d9" class="outline-3">
<h3 id="org70e40d9"><span class="section-number-3">3.2</span> 3.2. 对 "apt-fast" 进行设置（新版本安装完成后会显示设置窗口）：</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sh">sudo gedit /etc/axelrc

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#35774;&#32622;&#21512;&#36866;&#30340;&#32447;&#31243;&#25968;&#65292;&#40664;&#35748;&#20026; 4</span>
<span style="color: #7590db;">num_connections</span> = Num
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e75bed" class="outline-3">
<h3 id="org7e75bed"><span class="section-number-3">3.3</span> 3.3. 用 "apt-fast" 代替 "apt-get" 使用：</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-sh">sudo apt-fast update
sudo apt-fast install **
sudo apt-fast upgrade
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcc54f9d" class="outline-2">
<h2 id="orgcc54f9d"><span class="section-number-2">4</span> 4. Ubuntu13.10 源列表</h2>
<div class="outline-text-2" id="text-4">
<p>
*注意： <code>deb</code> 是软件源，=deb-src=
是软件源代码源。源码源已经删除，如需要请自行复制软件源并修改前缀 <code>deb</code>
为 'deb-src'。*
</p>

<pre class="example">
#中科大源
deb http://mirrors.ustc.edu.cn/ubuntu/ saucy main restricted universe multiverse
deb http://mirrors.ustc.edu.cn/ubuntu/ saucy-security main restricted universe multiverse
deb http://mirrors.ustc.edu.cn/ubuntu/ saucy-updates main restricted universe multiverse
deb http://mirrors.ustc.edu.cn/ubuntu/ saucy-proposed main restricted universe multiverse
deb http://mirrors.ustc.edu.cn/ubuntu/ saucy-backports main restricted universe multiverse

#华中科技大学源
deb http://mirror.hust.edu.cn/ saucy main restricted universe multiverse
deb http://mirror.hust.edu.cn/ saucy-security main restricted universe multiverse
deb http://mirror.hust.edu.cn/ saucy-updates main restricted universe multiverse
deb http://mirror.hust.edu.cn/ saucy-proposed main restricted universe multiverse
deb http://mirror.hust.edu.cn/ saucy-backports main restricted universe multiverse

#官方源
deb http://archive.ubuntu.com/ubuntu/ saucy main restricted universe multiverse
deb http://archive.ubuntu.com/ubuntu/ saucy-security main restricted universe multiverse
deb http://archive.ubuntu.com/ubuntu/ saucy-updates main restricted universe multiverse
deb http://archive.ubuntu.com/ubuntu/ saucy-proposed main restricted universe multiverse
deb http://archive.ubuntu.com/ubuntu/ saucy-backports main restricted universe multiverse

#Ubuntu 官方提供的其他软件（第三方闭源软件等）：
deb http://archive.canonical.com/ubuntu/ saucy partner
deb http://extras.ubuntu.com/ubuntu/ saucy main

#上海交大
deb http://ftp.sjtu.edu.cn/ubuntu/ saucy main restricted universe multiverse
deb http://ftp.sjtu.edu.cn/ubuntu/ saucy-security main restricted universe multiverse
deb http://ftp.sjtu.edu.cn/ubuntu/ saucy-updates main restricted universe multiverse
deb http://ftp.sjtu.edu.cn/ubuntu/ saucy-proposed main restricted universe multiverse
deb http://ftp.sjtu.edu.cn/ubuntu/ saucy-backports main restricted universe multiverse

#清华大学
deb http://mirrors.tuna.tsinghua.edu.cn/ubutu/ saucy main restricted universe multiverse
deb http://mirrors.tuna.tsinghua.edu.cn/ubuntu/ saucy-security main restricted universe multiverse
deb http://mirrors.tuna.tsinghua.edu.cn/ubuntu/ saucy-updates main restricted universe multiverse
deb http://mirrors.tuna.tsinghua.edu.cn/ubuntu/ saucy-proposed main restricted universe multiverse
deb http://mirrors.tuna.tsinghua.edu.cn/ubuntu/ saucy-backports main restricted universe multiverse

#天津大学
deb http://mirror.tju.edu.cn/ubuntu/ saucy main restricted universe multiverse
deb http://mirror.tju.edu.cn/ubuntu/ saucy-security main restricted universe multiverse
deb http://mirror.tju.edu.cn/ubuntu/ saucy-updates main restricted universe multiverse
deb http://mirror.tju.edu.cn/ubuntu/ saucy-proposed main restricted universe multiverse
deb http://mirror.tju.edu.cn/ubuntu/ saucy-backports main restricted universe multiverse

#东北大学
deb http://mirror.neu.edu.cn/ubuntu/ saucy main restricted universe multiverse
deb http://mirror.neu.edu.cn/ubuntu/ saucy-security main restricted universe multiverse
deb http://mirror.neu.edu.cn/ubuntu/ saucy-updates main restricted universe multiverse
deb http://mirror.neu.edu.cn/ubuntu/ saucy-proposed main restricted universe multiverse
deb http://mirror.neu.edu.cn/ubuntu/ saucy-backports main restricted universe multiverse

#台湾源（台湾的 ubuntu 更新源还是很给力的）
deb http://tw.archive.ubuntu.com/ubuntu/ saucy main universe restricted multiverse
deb http://tw.archive.ubuntu.com/ubuntu/ saucy-security universe main multiverse restricted
deb http://tw.archive.ubuntu.com/ubuntu/ saucy-updates universe main multiverse restricted
deb http://tw.archive.ubuntu.com/ubuntu/ saucy-proposed universe main multiverse restricted
deb http://tw.archive.ubuntu.com/ubuntu/ saucy-backports universe main multiverse restricted

#搜狐的源
deb http://mirrors.sohu.com/ubuntu/ saucy main restricted universe multiverse
deb http://mirrors.sohu.com/ubuntu/ saucy-updates main restricted universe multiverse
deb http://mirrors.sohu.com/ubuntu/ saucy-backports main restricted universe multiverse
deb http://mirrors.sohu.com/ubuntu/ saucy-security main restricted universe multiverse
deb http://mirrors.sohu.com/ubuntu/ saucy-proposed main restricted universe multiverse
</pre>
</div>
</div>
